trade_exp/src/Catalogs/Претензии/Претензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Претензии</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВиновныйСотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВиновноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОписаниеПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаВозникновения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РезультатыОтработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>МенеджерПоставок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОснованиеЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c9cae79c-a16b-40d9-8488-03d26096d8e3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cc67b352-c0f9-4ea4-aa3b-d5b88a11aedf">
    <name>ИДБизнесПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="84fcecf8-663e-4d3d-ab50-6b8838f0ebed">
    <name>ПредоставлениеФотоВидео</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fc62e94d-5667-43bb-b726-6886ce3e6ffd">
    <name>ДатаПредоставления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4d077e7b-7ba7-4dee-b907-39b3e8dbf89c">
    <name>ИсточникПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c99bcc81-7489-411c-8dcb-c8926c6b23c4">
    <name>НомерИсходящегоПисьмаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c36a5a8a-cd17-4c15-ade1-6de876c81534">
    <name>СуммаУдовлетворения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d07ae2c1-2c31-4135-9010-220439eb95b1">
    <name>СтатусПретензииПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="339626c5-c53c-4925-95fb-fb5c4cde6945">
    <name>ЭтоПретензияПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="741f1a90-1b36-4eb7-b101-3d87617e7979">
    <name>ВестиРасчетыПоПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="183f5f2c-d3fb-4930-a647-272852e2a96c">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f64c00cc-654d-4d80-a116-4fc31bb1ff3d">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ba1b449-0126-4391-9be0-311b38f07b38">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="99e3ab5c-1219-4baf-966f-b057f51d380e">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="05fd5b83-2b3a-457a-88a8-178c7c1c7e57">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8d6fbe9-5246-4731-bf64-1f9886b04b35">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01617f9e-3e2c-46c1-8e50-8a851d168fce">
    <name>ДатаОтветаПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f82078ee-7857-4352-8194-eb0fcffb3186">
    <name>РезультатПоПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c14348e-0b03-469a-bbdc-58a117de5e66">
    <name>ЕстьПисьменнаяПретензия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="02926def-a90f-4f64-9dd3-f193937d3316">
    <name>ДатаПисьменнойПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f7fc051e-b717-45c4-b0d0-7579bb1d0375">
    <name>СуммаПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5b0375fa-7fe1-4029-91fb-1919523bc9ca">
    <name>МестонахождениеТовара</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b44581f6-a7e7-4f6a-bef1-347e03c7283b">
    <name>НомерЗадачиВБитриксе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>РольПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>РольКонтактногоЛица</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Оборот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e6ca0a5a-24fa-4157-b555-58ff1aa5235c">
      <name>КоличествоБрак</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/Претензии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  
	
&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Статус = Перечисления.СтатусыПретензийКлиентов.Зарегистрирована Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПричинаВозникновения");
	КонецЕсли;
	
	#Вставка 
	//Доработки для претензий поставщику
	Если ЭтоПретензияПоставщику Тогда
		
		Если НЕ РезультатПоПретензии = Перечисления.РезультатыРассмотренияПретензииПоставщику.УдовлетворенаЧастично Тогда
			МассивНепроверяемыхРеквизитов.Добавить("СуммаУдовлетворения");
		КонецЕсли;	
		
		МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончания");
		Если НЕ СтатусПретензииПоставщику = Перечисления.СтатусыПретензийПоставщику.Завершена Тогда
			МассивНепроверяемыхРеквизитов.Добавить("РезультатыОтработки");
			МассивНепроверяемыхРеквизитов.Добавить("РезультатПоПретензии");
		КонецЕсли;    
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Количество");
			
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("СуммаУдовлетворения"); 
		МассивНепроверяемыхРеквизитов.Добавить("ИсточникПретензии"); 
		МассивНепроверяемыхРеквизитов.Добавить("НомерИсходящегоПисьмаПоставщику");
		МассивНепроверяемыхРеквизитов.Добавить("РезультатПоПретензии");  
		МассивНепроверяемыхРеквизитов.Добавить("СтатусПретензииПоставщику");	
	#КонецВставки
		Если Статус = Перечисления.СтатусыПретензийКлиентов.Зарегистрирована ИЛИ Статус = Перечисления.СтатусыПретензийКлиентов.Обрабатывается Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончания");
			МассивНепроверяемыхРеквизитов.Добавить("РезультатыОтработки");
		КонецЕсли; 
	#Вставка
	КонецЕсли;
	#КонецВставки
	
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПартнерыИКонтактныеЛица.Партнер");
		Для ТекИндекс = 0 По ПартнерыИКонтактныеЛица.Количество() - 1 Цикл
			Если Не ЗначениеЗаполнено(ПартнерыИКонтактныеЛица[ТекИндекс].Партнер) Тогда
				
				АдресОшибки = " " + НСтр("ru = 'в строке %НомерСтроки% списка ""Участники""'");
				АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", ПартнерыИКонтактныеЛица[ТекИндекс]["НомерСтроки"]);
				
				ТекстОшибки = НСтр("ru = 'Не заполнена колонка ""Контрагент""'");
				ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки + АдресОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПартнерыИКонтактныеЛица", ПартнерыИКонтактныеЛица[ТекИндекс].НомерСтроки, "Партнер"),
				,
				Отказ);
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Партнер) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Партнер");
		ТекстОшибки = НСтр("ru = 'Поле ""Клиент"" не заполнено'");
		Если ЭтоПретензияПоставщику Тогда
			ТекстОшибки = НСтр("ru = 'Поле ""Поставщик"" не заполнено'");
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"Партнер",
		,
		Отказ);
	КонецЕсли;
	
	Если НЕ ВестиРасчетыПоПретензии Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Организация");
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("Валюта");
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Наименование");   
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
	ПроверяемыеРеквизиты,
	МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//Доработки для претензий поставщику
	Если ЭтоПретензияПоставщику Тогда
		ДатаОтветаПоставщика = ДатаРегистрации + 864000;
		Исполнитель = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры
                                   
&ИзменениеИКонтроль("ПередЗаписью")
Процедура Док_ПередЗаписью1(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ПустаяСтрока(Код) Тогда
		УстановитьНовыйКод();
	КонецЕсли;
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = Справочники.Претензии.АвтоНаименование(ЭтотОбъект);
	КонецЕсли; 
	
	#Вставка
	//Доработки для претензий поставщику
	Если ЭтоПретензияПоставщику Тогда  
		
		Если ЕстьСтрокиСПустымКоличеством() Тогда
			Отказ = Истина;
		КонецЕсли; 
		
		Если РезультатПоПретензии = Перечисления.РезультатыРассмотренияПретензииПоставщику.УдовлетворенаВПолномОбъеме Тогда
			СуммаУдовлетворения = СуммаПретензии;
		КонецЕсли;   
		
		Если СтатусПретензииПоставщику = Перечисления.СтатусыПретензийПоставщику.ВРаботе Тогда   
			Если Комментарий = "" Тогда
				Отказ = Истина;
				Сообщить("Комментарий не заполнен!");
			КонецЕсли;
			Если Исполнитель = Справочники.Пользователи.ПустаяСсылка() Тогда 
				Отказ = Истина; 
				Сообщить("Исполнитель не заполнен!");
			КонецЕсли;
		КонецЕсли;
		
		Если СтатусПретензииПоставщику = Перечисления.СтатусыПретензийПоставщику.Завершена    Тогда   
			
			Если Ссылка.СтатусПретензииПоставщику <> Перечисления.СтатусыПретензийПоставщику.Завершена Тогда 
				ДатаОкончания = ТекущаяДата();  
			КонецЕсли;  
			
		Иначе
			ДатаОкончания = Дата(1, 1, 1);
			РезультатПоПретензии = Перечисления.РезультатыРассмотренияПретензииПоставщику.ПустаяСсылка();
			СуммаУдовлетворения = 0;
		КонецЕсли;
	Иначе
		
		#КонецВставки
		
		Если (Статус = Перечисления.СтатусыПретензийКлиентов.Зарегистрирована)
			Или (Статус = Перечисления.СтатусыПретензийКлиентов.Обрабатывается) Тогда
			ДатаОкончания = Дата(1, 1, 1);
		КонецЕсли; 
		
		#Вставка  
	КонецЕсли;
	#КонецВставки
	
	ВзаиморасчетыСервер.ПередЗаписью(ЭтотОбъект, Отказ);
	
КонецПроцедуры 

Функция ЕстьСтрокиСПустымКоличеством()
	
	Запрос = Новый Запрос; 
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВтТовары
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.Количество = 0
	|	И Товары.КоличествоБрак = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВтТовары КАК ВтТовары";
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить()); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	НомераСтрок = "";
	
	Пока Выборка.Следующий() Цикл
		Если НомераСтрок = "" Тогда
			НомераСтрок = НомераСтрок + Выборка.НомерСтроки;	
		Иначе 
			НомераСтрок = НомераСтрок + ", " +  Выборка.НомерСтроки;	
		КонецЕсли;
	КонецЦикла;
	
	Если Выборка.Количество()>0 Тогда   
		Сообщить("Пустое количество в строках: " + НомераСтрок);
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	КонецФункции
	
#КонецЕсли
